{
  "task_id": "cf_58428",
  "entry_point": "sketch_svg",
  "mutant_count": 2,
  "mutants": [
    {
      "operator": "CRP",
      "lineno": 2,
      "original_line": "\"\"\"",
      "mutated_line": "\"\"\"\"\"\"",
      "code": "def sketch_svg(svg_string):\n    \"\"\"\"\"\"\n    message = '\\n    There isn\\'t a straightforward way to give SVG a sketched or hand-drawn effect \\n    straight from the SVG code. SVGs are made up of precise mathematical coordinates \\n    and paths, which don\\'t lend themselves to an organic hand-drawn style.\\n\\n    However, there are methods that you can use to achieve a similar look:\\n    1. Use JavaScript or CSS: You can use JavaScript libraries like rough.js \\n    (https://roughjs.com/) or CSS techniques to manipulate SVG paths to create a \\n    sketch effect. However, this can be complex and requires programming knowledge.\\n\\n    2. Use a graphic design tool: This is probably the simplest solution. You can \\n    use graphic design tools like Adobe Illustrator or even open-source tools like \\n    GIMP or Inkscape. Draw or trace over your shape by hand using the Brush tool to \\n    create a rough, sketched look.\\n\\n    3. Use an online converter: There are online tools that can convert your clean \\n    SVG shapes into a more hand-drawn style. One such tool is \"Rough.js\" \\n    (https://roughjs.com/), which will generate the JavaScript or rough SVG code for you.\\n\\n    4. Use a font: If your SVG is text-based, consider using a font that has a \\n    hand-drawn style for an equally effective solution.\\n\\n    Please note that all these methods will require you to have at least some basic \\n    knowledge of graphic design or programming.\\n    '\n    return message"
    },
    {
      "operator": "CRP",
      "lineno": 12,
      "original_line": "message = \"\"\"",
      "mutated_line": "message = ''",
      "code": "def sketch_svg(svg_string):\n    \"\"\"\n    This function takes an SVG string as input and returns a message describing \n    the methods available to achieve a sketched or hand-drawn effect.\n\n    Parameters:\n    svg_string (str): The input SVG string.\n\n    Returns:\n    str: A message describing the methods available to achieve the sketched effect.\n    \"\"\"\n    message = ''\n    return message"
    }
  ]
}